Power-Law/wedge_needles/temperature/25_temp/45_needle_layer_pimpleFoam/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1;

deltaT          0.000025;

writeControl    runTime;

writeInterval   0.00001;

writeControl    adjustableRunTime;

purgeWrite      0;

writeFormat     binary;

writePrecision  12;

writeCompression off;

timeFormat      general;

timePrecision   12;

runTimeModifiable true;

maxCo           0.9;

maxAlphaCo      0.5;

maxDeltaT       1e-02;

functions
{
	#includeFunc shearStress
	#includeFunc wallShearStress
	#includeFunc strainRate
	#includeFunc grad(U)
	
	residuals
    {
        type            residuals;
        functionObjectLibs ("libutilityFunctionObjects.so");
        enabled         true;
        writeControl   timeStep;
        writeInterval  1;

        fields
        (
            U
            p
        );
    }
}

// ************************************************************************* //
